---
kind: method
id: M:Autodesk.Revit.DB.DGNExportOptions.GetExportLineweightTable
source: html/4be0abc7-0033-3f99-52c3-2e407cbd8fa0.htm
---
# Autodesk.Revit.DB.DGNExportOptions.GetExportLineweightTable Method

Gets a copy of the line weight table.

## Syntax (C#)
```csharp
public ExportLineweightTable GetExportLineweightTable()
```

## Returns
The line weight table.